In [138]:
import pandas as pd

In [139]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")
result = pd.read_csv("result.csv")

In [140]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [141]:
train.shape

(891, 12)

In [143]:
train.drop(["PassengerId","Name","Ticket"],axis=1,inplace=True)

In [144]:
test.drop(["PassengerId","Name","Ticket"],axis=1,inplace=True)

In [145]:
train.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [146]:
train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [147]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [148]:
train.drop(["SibSp","Parch"],axis=1,inplace=True)

In [149]:
train.head()

   Survived  Pclass     Sex   Age     Fare Cabin Embarked
0         0       3    male  22.0   7.2500   NaN        S
1         1       1  female  38.0  71.2833   C85        C
2         1       3  female  26.0   7.9250   NaN        S
3         1       1  female  35.0  53.1000  C123        S
4         0       3    male  35.0   8.0500   NaN        S

In [150]:
test.drop(["SibSp","Parch"],axis=1,inplace=True)

In [142]:
test.shape

(418, 11)

In [151]:
test.head()

   Pclass     Sex   Age     Fare Cabin Embarked
0       3    male  34.5   7.8292   NaN        Q
1       3  female  47.0   7.0000   NaN        S
2       2    male  62.0   9.6875   NaN        Q
3       3    male  27.0   8.6625   NaN        S
4       3  female  22.0  12.2875   NaN        S

In [152]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [153]:
train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [154]:
train.drop(["Cabin"],axis=1,inplace=True)

In [155]:
test.drop(["Cabin"],axis=1,inplace=True)

In [156]:
train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
Embarked      2
dtype: int64

In [157]:
train['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [158]:
train["Embarked"]=le.fit_transform(train["Embarked"])

In [159]:
train.head()

   Survived  Pclass     Sex   Age     Fare  Embarked
0         0       3    male  22.0   7.2500         2
1         1       1  female  38.0  71.2833         0
2         1       3  female  26.0   7.9250         2
3         1       1  female  35.0  53.1000         2
4         0       3    male  35.0   8.0500         2

In [160]:
test["Embarked"]=le.fit_transform(test["Embarked"])

In [161]:
test.head()

   Pclass     Sex   Age     Fare  Embarked
0       3    male  34.5   7.8292         1
1       3  female  47.0   7.0000         2
2       2    male  62.0   9.6875         1
3       3    male  27.0   8.6625         2
4       3  female  22.0  12.2875         2

In [163]:
train.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
dtype: int64

In [164]:
test.isnull().sum()

Pclass       0
Sex          0
Age         86
Fare         1
Embarked     0
dtype: int64

In [165]:
test["Age"].fillna(test["Age"].median(skipna=True),inplace=True)

In [168]:
test["Fare"].fillna(test["Fare"].median(skipna=True),inplace=True)

In [169]:
test.isnull().sum()

Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
dtype: int64

In [162]:
train["Age"].fillna(train["Age"].median(skipna=True),inplace=True)

In [170]:
train["Sex"]=le.fit_transform(train["Sex"])
test['Sex']=le.fit_transform(test['Sex'])

In [171]:
train.head()

   Survived  Pclass  Sex   Age     Fare  Embarked
0         0       3    1  22.0   7.2500         2
1         1       1    0  38.0  71.2833         0
2         1       3    0  26.0   7.9250         2
3         1       1    0  35.0  53.1000         2
4         0       3    1  35.0   8.0500         2

In [172]:
test.head()

   Pclass  Sex   Age     Fare  Embarked
0       3    1  34.5   7.8292         1
1       3    0  47.0   7.0000         2
2       2    1  62.0   9.6875         1
3       3    1  27.0   8.6625         2
4       3    0  22.0  12.2875         2

In [208]:
import numpy as np
train['Fare']=train['Fare'].astype(int)
test['Fare']=test['Fare'].astype(int)
train['Age']=train['Age'].astype(int)
test['Age']=test['Age'].astype(int)

In [209]:
train.head()

   Survived  Pclass  Sex  Age  Fare  Embarked
0         0       3    1   22     7         2
1         1       1    0   38    71         0
2         1       3    0   26     7         2
3         1       1    0   35    53         2
4         0       3    1   35     8         2

In [210]:
x_train = train.copy()

In [211]:
x_train.drop(['Survived'],axis=1,inplace=True)

In [212]:
x_test=train["Survived"]

In [213]:
from sklearn.ensemble import RandomForestClassifier

In [214]:
m = RandomForestClassifier(n_estimators=100,max_depth=5)

In [215]:
m.fit(x_train,x_test)

RandomForestClassifier(max_depth=5)

In [216]:
r=m.predict(test)

In [217]:
r

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0],
      dtype=int64)

In [218]:
from sklearn.metrics import accuracy_score

In [219]:
accuracy_score(r,result["Survived"].values)

0.9114832535885168